Repository: blind-tech/DescribeImages
Catalog: locale/*/LC_MESSAGES/nvda.po
Languages: ar, es

source: Describe Images with Gemini
ar: وصف الصور بواسطة Gemini
es: Describir imágenes con Gemini

source: Describe screen content using Gemini
ar: وصف محتوى الشاشة باستخدام Gemini
es: Describir el contenido de la pantalla usando Gemini

source: Please enter an API key from NVDA settings first.
ar: يرجى إدخال مفتاح API من إعدادات NVDA أولاً.
es: Por favor, ingrese primero una clave API desde la configuración de NVDA.

source: Description of the content of this image in detail (and in English).
ar: وصف محتوى هذه الصورة بالتفصيل (وباللغة العربية).
es: Descripción del contenido de esta imagen en detalle (y en el idioma español).

source: Gemini Response
ar: رد Gemini
es: Respuesta de Gemini

source: Failed to connect to the internet: {error}
ar: فشل في الاتصال بالإنترنت: {error}
es: Error al conectar a internet: {error}

source: Error processing server response
ar: خطأ في معالجة الرد من الخادم
es: Error al procesar la respuesta del servidor

source: Unexpected error: {error}
ar: خطأ غير متوقع: {error}
es: Error inesperado: {error}

source: Failed to describe image: {error}
ar: فشل في وصف الصورة: {error}
es: No se pudo describir la imagen: {error}

source: Chat with Gemini about the last captured image
ar: الدردشة مع Gemini حول آخر صورة تم التقاطها
es: Chatear con Gemini sobre la última imagen capturada

source: No image has been captured yet.
ar: لم يتم التقاط صورة بعد.
es: No se ha capturado ninguna imagen aún.

source: Chat with Gemini about the image
ar: دردشة مع Gemini حول الصورة
es: Chatear con Gemini sobre la imagen

source: Send
ar: إرسال
es: Enviar

source: ❌ Error: {error}
ar: ❌ خطأ: {error}

source: describeImages
ar: وصف الصور

source: Enter API key from Google AI Studio:
ar: أدخل مفتاح API من Google AI Studio:
es: Ingrese la clave API de Google AI Studio:

source: Play waiting sound while processing
ar: تشغيل صوت الانتظار أثناء المعالجة
es: Reproducir sonido de espera durante el procesamiento

source: Get API Key from Google AI Studio
ar: الحصول على مفتاح API من Google AI Studio
es: Obtener clave API de Google AI Studio
